##############################################
# 014_Списки
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

# year = 1900
# while year <= 2019:
#     print(year)
#     year += 1
# else:
#     print('Done')

#----------------------------------------------
# СПИСКИ - list()
#----------------------------------------------
l = [1, 2, 3, 'hello', ['test', 10], 'world', True]     # список
l2 = list('hello')      # итерируемый список
l3 = list((1, 2, 3))    # список с кортежем

print(l, l2, l3, sep='\n')
print()

#----------------------------------------------
# Г Е Н Е Р А Т О Р Ы   С П И С К О В
#----------------------------------------------
l4 = [char for char in 'hello']   # преобразовать слово в список литер
l5 = [i for i in 'hello world' if i != ' ' and i != 'e'] 
l5 = [i for i in 'hello world' if i not in ['a', 'e', 'i', 'o', 'u', ' ']]
l6 = [i*2 for i in 'hello world' if i not in ['a', 'e', 'i', 'o', 'u', ' ']]

print(l4, l5, l6, sep='\n')
print()

#----------------------------------------------
# ДИАПАЗОН (RANGE)
# range(start, stop, step)
#----------------------------------------------
l6 = list(range(0, 11))
print(l6)

for i in range(1, 3):
    print(f'Внешний цикл #{i}')
    for j in range(1, 3):
        print(f'\tВнутренний цикл #{j}')

###############################################
# ТАБЛИЦА УМНОЖЕНИЯ (ДЗ) - школьный вариант
###############################################
print('\nТаблица умножения:')
for i in range(1, 10):
    for j in range(1, 10):
        print(f'{i} * {j} = {i*j}', end=' | ')
    print(' ')
else:
    print('Well done')
