##############################################
# 026_Пользовательские функции.Часть 1
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

nc = 80
print()

s = 'Hello world'
print('ORIG:', s)
if ' ' in s:  # если хотя бы один пробел
    s = s.upper()  # верхний регистр
else:
    s = s.lower()  # нижний регистр
print('CONVERT:', s)
print('-' * nc)


# ---------------------------------------------------------
# test()
# ---------------------------------------------------------
def test(txt):
    print('TEST FUNC:', txt)


test('(1) Testing function...')
test('(2) Testing function...')
test('(3) Testing function...')
print('-' * nc)


# ---------------------------------------------------------
# hello()
# ---------------------------------------------------------
def hello(name, word):
    print('(1) Hello, ' + name + '. Say ' + word)
    print(f'(2) Hello, {name}. Say {word}')


hello('John', 'hi')
hello('Katy', 'hello')
print('-' * nc)


# ---------------------------------------------------------
# get_sum1()
# ---------------------------------------------------------
def get_sum1(a, b):
    print(a + b)


x = 2
y = 5
get_sum1(1, 3)
get_sum1(x, y)

print(len('Hello'))
print('-' * nc)


# ---------------------------------------------------------
#  get_sum2()
# ---------------------------------------------------------
def get_sum2(a, b):
    return a + b


print(get_sum2(1, 2))
print('-' * nc)


# ---------------------------------------------------------
# hi()
# ---------------------------------------------------------
def hi():
    print('Hi')


hi()
