##############################################
# 005_Арифметические операторы
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

import math

print(2 + 3)        # 5 (сложение чисел)
print('2' + '3')    # 23 (сложение строк)
print(10 - 3)       # 7 (вычитание)
print(10 * 3)       # 30 (умножение)
print(10 / 2)       # 5.0 (деление)

print(3 % 2)        # 1 (деление по модулю 2)
print(30 % 2)       # 0

print(3 // 2)       # 1 (целочисленное деление)
print(7 % 2)        # 1
print(7 // 2)       # 3

print (-5 - 3)      # -8
print(5 ** 2)       # 25 (возведение в степень)
print(5 ** 3)       # 125

print(25 ** 0.5)    # 5 (корень квадратный - 0.5)
print(100 ** 0.5)   # 10

############################################
print(math.sqrt(100))   # 10
############################################

print(2 + 3 * 4)    # 14
print((2 + 3) * 4)  # 20

###########################################
# FLOAT
###########################################
print(0.5 + 1.5)    # 2
print(.5 + 2)       # 2.5
print(0.1 + 0.2)    # 0.30000000000000004
