##############################################
# 009_Операции со строками
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

# c экранирующими символами \
s = 'C:\\d\\new.txt'
print(s)

# "cырая" строка (r) - юез обработки
s = r'C:\d\new.txt'
print(s)

# конкатенация строк
s = 'Py' 'thon'
print(s)

s1 = 'Hello, '
s2 = 'world!'
s3 = s1 + s2
print(s3)

name = 'Jonn'
age = 20
print('My name is ' + name + ", I'm " + str(age))

# повторение
print('hi ' * 5)

###############################
# индексы
###############################
s = "Hello world!"
print(s[0])     # первый символ
print(s[-1])    # последний символ
print(s[-2])    # второй символ с конца
print(s[-12])   # первый символ

###############################
# срезы
###############################
'''
+---+---+---+---+---+---+---+---+---+---+---+---+
| H | e | l | l | o |   | w | o | r | l | d | ! |
+---+---+---+---+---+---+---+---+---+---+---+---+
0   1   2   3   4   5   6   7   8   9  10  11  12
-12 -11 -10 -9  -8  -7  -6  -5  -4  -3  -2 -1
'''
# [X:Y:Z]
# X - начало среза
# Y - окончание среза
# Z - шаг среза
s = 'Hello world!'

print(s[0:12])          # Hello world!
print(s[-1])            # !
print(s[0:5])           # Hello
print(s[:5])            # Hello
print(s[6:])            # world!
print(s[::2])           # Hlowrd (step = 2)
print(s[::-1])          # !dlrow olleH (reverse!!!)
print(s[:5] + s[6:])    # Helloworld!
