##############################################
# 004_004_Синтаксис Python
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

#-------------------------------------------------------
# pip -V      (version)
# pip freeze  (install)
# pip list    (install)
#-------------------------------------------------------

# Текст комментария
print("*****************")
print('Hello, world !!!')
print('Hello, world2 !!!')

'''
Это
многострочный
комментарий
(одинарные кавычки)
'''

"""
Три кавычки: 
в начале 
и в конце  
(двойные кавычки)
"""

# не рекомендуется!!!
print("*****************")
print('Hello, world3 !!!'); print('Hello, world4 !!!')
print("*****************")


##############################
# T E M P L A T E (tkinter)
##############################
# from tkinter import *
#
# root = Tk()
#
# root.mainloop()
