# This is a sample Python script.

# Нажмите Shift+F10, чтобы выполнить его или заменить своим кодом.
# Нажмите дважды Shift, чтобы выполнить поиск классов, файлов, окон инструментов, действий и настроек.

def print_hi(name):
    # Используйте точку останова в строке кода ниже для отладки вашего скрипта.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Нажмите зеленую кнопку в меню, чтобы запустить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/

####################################################################
# FOR CREATE HTML FILE
# "! + TAB"
####################################################################
