##############################################
# 018_Домашнее задание
# python 3.x
# WebForMySelf - Андрей Кудлай, 2019
##############################################
# Writing sgiman, 2025

"""
1. Дан список. Получите новый список, в котором каждое значение будет удвоено:
[1, 2, 3] --> [2, 4, 6]
"""

"""
2. Дан список. Возведите в квадрат каждый из его элементов и получит сумму всех полученных квадратов:
[1, 2, 3] --> 14 --> 1^2 + 2^2 + 3^2 = 14
"""

"""
3. Игорь любит кататься на велосипеде. Он знает, что при этом важно не допустить обезвоживания
 и пьет 0,5 литра воды в час. Вам дается время в часах, и вам нужно вернуть количество литров, 
 которые Игорь выпьет, с округлением до наименьшего значения.
time1 = 3 --> litres = 1
time2 = 6.7 --> litres = 3
time3 = 11.8 --> litres = 5
"""

"""
4. Дана строка 'Hello world'. Проверьте, если в этой строке есть символ пробела - 
" ", тогда преобразуйте строку к верхнему регистру, если же нет, тогда к нижнему.
***************
s = 'Hello world'
if stm:
	pass
else:
	pass
"""
